blog-posts/2004-01-25-weblogs-as-filing-cabinets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Weblogs as Filing Cabinets</title>
<!-- 2014-04-30 Wed 17:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Weblogs as Filing Cabinets</h1>
<p>
January 25th, 2004 -
<a href="http://sachachua.com/blog/p/1633"><a href="http://sachachua.com/blog/p/1633">http://sachachua.com/blog/p/1633</a></a>
</p>

<p>
<a href="http://blogs.salon.com/0002007/categories/businessInnovation/2003/03/03.html"><a href="http://blogs.salon.com/0002007/categories/businessInnovation/2003/03/03.html">http://blogs.salon.com/0002007/categories/businessInnovation/2003/03/03.html</a></a>
</p>

<blockquote>
<p>
Weblogs could be a mechanism to coherently codify and
 ‘publish' in a completely voluntary and personal manner the
individual
 worker's entire filing cabinet, complete with annotations,
marginalia,
 post-its and personal indexing system.
</p>
</blockquote>

<p>
Precisely why I use planner+remember&#x2026;
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
